

// ignore: non_constant_identifier_names
String History = '''How to Publish a Short Story: Submit Your Story

How to Publish a Short Story: Final Steps. Well, we’re here. You’ve planned, written, and workshopped your short story. It’s ready to go. Now it’s time to release that baby into the world! This is the scary part. You’re looking at the guidelines for the publication you chose week one and you think your story is ready. But how exactly do you go about sending one out? What all do you need? What’s the professional etiquette? Here are the last steps to submission: 10. Prepare Your ...

Where to Publish Writing by Teens & Older Students
stonesoup.com
First published in 1992, The Claremont Review published short stories, poems, short plays, graphic art, photography, and interviews each year in the spring and fall, although no fall 2018 or spring 2019 issues are planned. Visit their facebook page for updates on this publication’s current status. Website. Launch Pad. Age Range: 6 to 14 Accepts: fiction, nonfiction, and poetry, and illustrations by assignment. Launch Pad publishes stories, art, poetry, nonfiction, and book reviews by kids ...

Wattpad - Where stories live
www.wattpad.com
Wattpad Books aspires to recognize and reflect diverse voices by taking Wattpad stories to published book and onto bookshelves around the world. Wattpad Books works with partners such as: Find out more about what we do for writers → How Wattpad Works. Get your story discovered through the power of community and technology on Wattpad. 1. Create. Share your''';

// ignore: non_constant_identifier_names
String Article = '''How to Publish a Short Story: Submit Your Story

How to Publish a Short Story: Final Steps. Well, we’re here. You’ve planned, written, and workshopped your short story. It’s ready to go. Now it’s time to release that baby into the world! This is the scary part. You’re looking at the guidelines for the publication you chose week one and you think your story is ready. But how exactly do you go about sending one out? What all do you need? What’s the professional etiquette? Here are the last steps to submission: 10. Prepare Your ...

Where to Publish Writing by Teens & Older Students
stonesoup.com
First published in 1992, The Claremont Review published short stories, poems, short plays, graphic art, photography, and interviews each year in the spring and fall, although no fall 2018 or spring 2019 issues are planned. Visit their facebook page for updates on this publication’s current status. Website. Launch Pad. Age Range: 6 to 14 Accepts: fiction, nonfiction, and poetry, and illustrations by assignment. Launch Pad publishes stories, art, poetry, nonfiction, and book reviews by kids ...

Wattpad - Where stories live
www.wattpad.com
Wattpad Books aspires to recognize and reflect diverse voices by taking Wattpad stories to published book and onto bookshelves around the world. Wattpad Books works with partners such as: Find out more about what we do for writers → How Wattpad Works. Get your story discovered through the power of community and technology on Wattpad. 1. Create. Share your''';

String Kondotty =''' കൊണ്ടോട്ടി ഖിലാഫത്ത് സമ്മേളനത്തിന്റെ സ്വാഗതസംഘം അദ്ധ്യക്ഷനായിരുന്നു കെ.പി. ബീരാൻ ഹാജി ( വലിയപറമ്പ് ) , ഖിലാ ഫത്ത് സമ്മേളനത്തിൽ പങ്കെടുക്കരുതെന്ന് അദ്ദേഹത്തോട് സർക്കിൾ ഇൻസ്പെക്ടർ നീലകണ്ഠൻ നായരും സബ് ഇൻസ്പെക്ടർ കു
നിരാമൻ നായരും ശക്തിയായി താക്കീത് ചെയ്തിരുന്നു . എന്നാൽ - സാൻ ഹാജി വിലാഫത്ത് സമ്മേളനത്തിൽ പങ്കെടുക്കുക മാത്രമല്ല നിയപറമ്പിൽ ഖിലാഫത്ത് യോഗം സംഘടിപ്പിക്കുകയും ചെയ്തു . വനിയിലെ വിലാഫത്ത് യോഗത്തിൽ കെ.എം. മൗലവിയും ചെറുശ്ശേരി അഹമ്മദ്കുട്ടി മൗലവിയും പങ്കെടുത്തു . സി.ഐ.യുടെയും എസ്.ഐ. യുടെയും പ്രേരണ പ്രകാരമാണ് പട്ടാളം പുളിക്കലിൽ നിന്നും വലിയപറമ്പിലേക്ക് മാർച്ച് ചെയ്തത് . കൊണ്ടോട്ടിക്കടുത്തുള്ള വലിയപറമ്പ് ( പുളിക്കൽ ) ബ്രിട്ടീഷ് പട്ടാ കൂരമായ തേർവാഴ്ച നടത്തി .
 ഖിലാഫത്ത് നേതാവ് കുടുക്കിൽ ബിൻഹാജിയെ അന്വേഷിച്ചാണ് പട്ടാളം സ്ഥലത്തെത്തിയത് . നേ താവിനെ കിട്ടാത്ത അരിശം പാവപ്പെട്ട സ്ത്രീകളെയും കുട്ടികളെയും പീഡിപ്പിക്കുന്നതിൽ കലാശിച്ചു . ഗൂർഖ റജിമെന്റാണ് അതിനീചമായ പ്രവർത്തനങ്ങൾക്ക് നേതൃത്വം നൽകിയത് . 13 സ്ത്രീകൾ ചെമ്മൻകൊടി പുരയിൽ വച്ചു വെടിയേറ്റുമരിച്ചു . ബീരാൻ ഹാജിയുടെ ഭാര്യ കദീശുമ്മ ബിച്ചുമ്മ എന്നിവരും രക്തസാക്ഷികളായി . മൊത്തം സ്ത്രീകളും കു ടികളുമടക്കം 22 പേർ ചെമ്മൻ തൊടിയിൽ മാത്രം കൊല്ലപ്പെട്ടു . 200 - ൽ അധികം പുരകൾ ചുട്ടുചാമ്പലാക്കി . പള്ളിയുടെ മിമ്പറ തകർത്തു . ഖു ർആൻ ദൂരെയെറിഞ്ഞു . ആണുങ്ങളും പെണ്ണുങ്ങളും ഒയോക്ക്മലയിൽ ഒളിച്ചു 
 ദിവസങ്ങൾ പച്ചിലയും വെള്ളവും മാത്രം ഭക്ഷണം നേതാവ് ബീരാന്റെ 
 ബാപ്പയുടെ പെട്ടിയും പണവും പട്ടാളം കൊള്ളയടിച്ചു . കുടുക്കിൽ അഹമ്മദ് ഹാജിയുടെ മാതാവ് മമ്മിയ്യ ( 85 വയസ്സ് ) എന്ന വൃദ്ധ സ്ത്രീയെ പട്ടാളം ചുട്ടുകൊന്നു . വീട് തീവയ്ക്കാൻ ശ്രമിച്ചപ്പോൾ പ്രതിരോധിച്ചതാണ് കാരണം അവരെ വെടിവച്ച് കൊന്ന് തീയിലേക്ക് എറിയുകയാണുണ്ടായത് . കാഞ്ഞിരത്തെരുവിൽ 22 ഹരിജനങ്ങളെ ബ്രിട്ടീഷ് പട്ടാളം വെ ടിവെച്ചുകൊന്നു . ആയക്കുട്ടി എന്ന യുടെ ഒക്കത്തിരിക്കുന്ന പിഞ്ചുകുട്ടി വെടിയേറ്റുമരിച്ചു . എല്ലാം കഴിഞ്ഞതിനുശേഷം വിവര അറിയാൻ ചെമ്മൻ തൊടി പുരയിലെത്തിയത് കുടുക്കിൽ കോളാമ്പള്ളി മമ്മദ് , കുടുക്കിൽ ചമ്മിണിത്തൊടി വീരാൻ , കുടുക്കിൽ വീരാൻ കുട്ടി എന്നിവരാണ് രാത്രി വിളക്ക് കത്തിച്ച് മയ്യത്തെല്ലാം പള്ളിപ്പറമ്പിൽ മറവ് ചെയ്തു . അവശേഷിക്കുന്ന കുട്ടികളും പെണ്ണുങ്ങളും 
 കൊണ്ടോട്ടി തക്കിയക്കൽ അഭയം തേടി ചെമ്പാലക്കുന്നിലെ നരഹത്യ നെടിയിരുപ്പിൽ നിന്ന് മൊറയൂരലേക്ക് നീണ്ടുകിടക്കുന്ന ചെമ്പാ
അതികഠിനമായ ഏറ്റുമുട്ടൽ നടന്നു . ആനക്കയം , വേങ്ങര , നിവാസി ലക്കുന്നിൽ ഖിലാഫത്ത് സമരഭടൻമാരും ബ്രിട്ടീഷ് പട്ടാളക്കാരുമായി കളായ സമര ഭടന്മാർ ബ്രിട്ടനെതിരെ പോരാടാൻ തന്ത്രപ്രധാനമായ സ്ഥലം നോക്കി തമ്പടിച്ചത് ചെമ്പാല മലയിലായിരുന്നു . സമര ഭടന്മാർ ചെമ്പാല കുന്നിന്റെ തന്ത്രപ്രധാനമായ ഭാഗത്ത് നിറത്തോക്കുകളും റോഡിൽ വന്നെത്തിയപ്പോൾ സമരക്കാർ അതി ത്വരിതമായി വെടി യി നിലയുറപ്പിച്ചു . ബ്രിട്ടീഷ് പട്ടാളക്കാർ ചേറ്റുവെട്ടി കളത്തിനടുത്ത വയ്ക്കാൻ ആരംഭിച്ചു . കുറേ പട്ടാളക്കാർ മരണപ്പെട്ടു . പട്ടാളത്തിന് അവസാനം മൊറയൂരിലെ ബ്രിട്ടീഷ് കക്ഷിക്കാരനായ ഒരു മുസ്ലീം പ ലഹളക്കാരെ കാണാനൊത്തില്ല . ബ്രിട്ടീഷ് പട്ടാളം പിന്നോട്ട് മടങ്ങി നേതാവ് പട്ടാളക്കാരെ
 മുസ്ലിയാരങ്ങാടി വഴി ചെമ്പാലക്കുന്നിന്റെ മറുവശത്തേക്ക് 
കൂട്ടിക്കൊണ്ടുപോയി . ഇങ്ങനെ ഒരു ചതി ലഹളക്കാർ പ്രതീക്ഷിച്ചിരുന്നില്ല . പട്ടാളക്കാരുടെ ആഗമനം അവർ അറിഞ്ഞില്ല . ഥിലമാക്കി . ഒരു കുട്ടി ഉൾപ്പെടെ 34 സമര ഭടന്മാർ വീരമൃത്യു വരിച്ചു . അവശേഷിച്ച ഏതാനും ആളുകൾ ഓടി രക്ഷപ്പെട്ടു . സമര ഭടന്മാരുടെ മൃതദേഹങ്ങളോട് ബ്രിട്ടീഷുകാർ അനാദരവ് കാണിച്ചു . മൃതദേഹങ്ങൾ വെട്ടിനുറുക്കി കഷ്ണം കഷ്ണമാക്കി . കോടിക്കൊടിക മുഹമ്മദാജി ഒസ്സാൻ വീരാൻകുട്ടി , പിടക്കോയി ഹസ്സൻ , മണ്ണിശ്ശേരി വീരാൻകുട്ടി മുതലായവർ മയ്യിത്തുകൾ മഞ്ചേരിപ്പറമ്പ് കല്ലുവെട്ടിക്കുഴിയിൽ സം സ്കരിച്ചു . അസൈനാർ , വലിയതൊടിക മൊയ്തീൻ ഹാജി എന്നിവരെ ചില കുറ്റങ്ങൾ ചുമത്തി ശിക്ഷിച്ചു ചെമ്പാലകുന്നിലെ സംഘട്ടനം ഹിന്ദു - മുസ്ലിം സൗഹൃദത്തിന്റെ നല്ല പാഠങ്ങളും നൽകുന്നുണ്ട് . 
ലഹളക്കാലത്ത് മൊണ്ടമ്പലം തെക്കെ ഇല്ലം വക ശിവക്ഷേത്രവും മൂസതുമാരുടെ ഭവനങ്ങളും ഒരു പോറലു മേൽക്കാതെ കാത്തു രക്ഷിച്ചത് മലയിൽ ശൈഖ് മുഹമ്മദ് മൗലവിയും കൂട്ടുകാരുമായിരുന്നു . നാടുനീളെ ലഹളയുടെ ധൂമപടലം പടർന്നു പിടിച്ചപ്പോൾ മുസ്ലിംകൾ ഇല്ലത്തെ സ്ത്രീകളെയും കുട്ടികളെയും മുതുവല്ലൂർ മൂസ്സതിന്റെ ഇല്ലത്തു കൊണ്ടുപോയി തമാസിപ്പിച്ചു . ചില ആഴ്ചകൾക്കകം അവരെല്ലാം വിശ്വസ്തരായ മുസ്ലിംകളോടൊന്നി ച്ച് കോഴിക്കോട്ടേക്ക് പോയി . മൊറയൂരിലെ നാരായണൻ മൂസ്സത് അവർകളും പുത്രൻമാരായ പരമേശ്വരൻ മൂസ്സത് കേശവൻ മൂസ്സത് എന്നിവരും ഇല്ലത്ത് തന്നെ താമസിച്ചു . മൊറയൂരിലേക്ക് പുറപ്പെട്ട ലഹളക്കാർ ഇല്ലത്ത് പ്രവേശിച്ചു . ലഹളക്കാരുടെ നേതാവ് മൂസ്സത് അവർകളെ സമീപിച്ച് ഇങ്ങനെ പറഞ്ഞു : ഞങ്ങൾ ബ്രിട്ടീഷ് പട്ടാള
തുമയി യുദ്ധത്തിന് വന്നതാണ് . അവസാനത്തെ ഊണ് ഇവിടുന്ന് മരണം ഇത് അവർക്ക് ഊൺ തയ്യാറാക്കാൻ കൽപിച്ചു . നിങ്ങൾക്ക് വേണമെങ്കിൽ കുട്ടിക്കാള മാംസവും ശരിപ്പെടുത്താം ' - എന്ന് മൂസ്സത് പറഞ്ഞു . ലഹളക്കാരുടെ നേതാവ് സമ്മതിച്ചില്ല . അദ്ദേഹം ഇങ്ങനെ പ്രതിവചിച്ചു : ' ഞങ്ങൾ ഒരിക്കലും അവിടുത്തെ വികാരത്തെ വേദനപ്പെ ടുത്താൻ ആഗ്രഹിക്കുന്നില്ല . പച്ചക്കറി ഊണ് മാത്രം മതി ഞങ്ങൾക്ക് അങ്ങനെ മൂസ്സതിന്റെ വെജിറ്റേറിയൻ സദ്യയും കഴിച്ചാണ് അവർ വിവരിക്കാൻ പോയത് . എക്കാപറമ്പ് വെടിവെപ്പ് കൊണ്ടോട്ടിയിൽ നിന്നും അരീക്കോട് റോഡിലൂടെ വടക്കോട്ട് പോയിരുന്ന പട്ടാളക്കാർ എക്കാപറമ്പിലെത്തിയപ്പോൾ , സ്ത്രീകളും കുട്ടികളും അടങ്ങിയ ഒരു സംഘം കൊണ്ടോട്ടിയിലേക്ക് നീങ്ങുന്നത് . കണ്ടു . ലഹള പ്രദേശത്ത് നിന്നും കൊണ്ടോട്ടി
 തങ്ങളുടെ അടുക്കൽ അഭയം തേടാൻ പുറപ്പെട്ടിരുന്ന നിരപരാധികൾ ബ്രിട്ടീഷ് പട്ടാളത്തിന്റെ തോക്കിന് ഇരയായി അക്കൂട്ടത്തിൽ വാഴക്കാട് സ്വദേശികളായിരുന്ന കളരിക്കൽ മൊയ്തീൻ , കളത്തിങ്ങൽ അഹമ്മദ് , ഭാര്യ ഖദീജ , മകൾ ആയിശുമ്മ എന്നിവർ തോക്കിനിരയായി ജദീദ് അബ്ദുറഹിമാൻ , ജദീദ് മുഹമ്മദ് കുട്ടി എന്നിവരും കൊല്ലപ്പെട്ടു . കുന്നാപ്പിള മുഹമ്മദ് ( എടവണ്ണ ) , തൊപ്പേക്കാടൻ കോയി ഉമ്മർ , കാവാട്ട് പോക്കുട്ടി , വാഴക്കാട് ) , ഭാര്യ എന്നിവർക്ക് പരിക്ക് പറ്റി . ഇത്തരത്തിലുള്ള ഇതിലും ഭീകരമായ എത്രയോ കൊലയും കൊ ള്ളിവയ്പ്പും പട്ടാളത്തിന്റെ കാർമ്മികത്വത്തിൽ ഏറനാട് - വള്ളുവനാട് താലൂക്കുകളുടെ വിവിധ ഭാഗങ്ങളിൽ നടന്നിട്ടുണ്ട് . ഇതിൽ ഒട്ടുമുക്കാലും ചരിത്രത്തിൽ രേഖപ്പെടുത്തുകയോ , വിശകലന വിധേയമാക്കുകയോ ചെയ്തിട്ടില്ല . മലപ്പുറം 
 മേൽമുറിയിൽ നിരപരാധികളായ 250 പേരെ യാണ് ഒറ്റയടിക്ക് ബ്രിട്ടീഷ് പട്ടാളം വെടിവച്ചുകൊന്നത് . ഏറനാട് വള്ളുവനാട് താലൂക്കിലെ ഓരോ ഗ്രാമത്തിനും ഇത്തരം കണ്ണീരിൽ കുതിർന്ന രക്തം കിനിയുന്ന ഓർമകൾ ഏമ്പാടുമുണ്ട് . ഇത്തരം ഓർമ്മകൾ കൂടി ചേർത്തു വെയ്ക്കുമ്പോഴെ മലബാർ സമരചരിത്രം പൂർണമാകുകയുള്ളൂ . ദളിത് പങ്കാളിത്തം മലബാർ സമരത്തിലെ ദളിത് പങ്കാളിത്തം അടയാളപ്പെടുത്തിയ ഒരു നാടൻ പാട്ടുണ്ട് . പ്രസിദ്ധീകരിക്കപ്പെട്ട കൃതികളിലൊന്നും രേഖ പ്പെട്ടിട്ടില്ലാത്ത ഈ പാട്ട് പ്രമുഖ മാപ്പിളപ്പാട്ട് രചയിതാവും ഇതിഹാസ
തുല്യനായ സ്ഥാനം വഹിക്കുന്ന മലയാളികളുടെ പ്രിയപ്പെട്ട മാപ്പിളപ്പാട്ട് ഗായകനുമായ വി.എം. കുട്ടി മാഷ് പാടിത്തരുകയുണ്ടായി . ''';


String MlabarKalabham ='''ഇന്ത്യയുടെ സ്വാതന്ത്ര്യസമര ചരിത്രത്തിൽ കാർഷിക കലാപമായും വർഗീയ കലാപമായും മാറി മാറി വ്യാഖ്യാനിക്കപ്പെട്ടു പോന്ന ഒന്നാണ് 'മാപ്പിള കലാപം',
 മലബാർ ലഹള, ഖിലാഫത്ത് സമരം, മാപ്പിളലഹള എന്നെല്ലാം അറിയപ്പെടുന്ന മലബാർ കലാപം.1921 ആഗസ്ററ് മാസം മുതൽ 
1922 ഫിബ്രവരി വരെ മലബാർ ജില്ലയിലെ ഏറനാട്, വള്ളുവനാട്, പൊന്നാനി, കോഴിക്കോട് താലൂക്കുകൾ കേന്ദ്രീകരിച്ചു ബ്രിട്ടീഷുകാർക്കെതിരായി മലബാർ 
മേഖലയിലെ മാപ്പിളമാർ ആരംഭിച്ച സായുധ കലാപമാണിത്.

ഏറനാട് താലൂക്ക് കേന്ദ്രീകരിച്ചു നടന്ന പ്രക്ഷോഭം പിന്നീട് മലബാർ ജില്ലയുടെ പല ഭാഗങ്ങളിലേക്കും വ്യാപിക്കുകയായിരുന്നു. ബ്രിട്ടീഷുകാർക്കു നേരെ 
ആരംഭിച്ച മാപ്പിള ലഹളയുടെ അവസാനഘട്ടത്തിൽ മാപ്പിളമാർ തങ്ങളുടെ ലഹളയെ അടിച്ചമർത്താൻ ബ്രിട്ടീഷ് സൈന്യത്തെ സഹായിക്കുന്നു എന്ന്
 ആരോപിച്ച് ഹൈന്ദവ പ്രമാണികൾക്ക് നേരെ വലിയ തോതിലുള്ള ആക്രമണമാണ് അഴിച്ചുവിട്ടത്.  ഈ ലഹളയുടെ ഭാഗമായി നിരവധി ഹൈന്ദവർ 
നിർബന്ധിത മത പരിവർത്തനത്തിന് വിധേയമാക്കപ്പെടുകയോ, വധിക്കപ്പെടുകയോ, പാലായനം ചെയ്യപ്പെടുകയോ ഉണ്ടായെന്നും ഒരു ലക്ഷത്തിലധികം 
പേരെ ഇത് ബാധിച്ചുവെന്നും ബ്രിട്ടീഷ് രാഷ്ട്രീയ പ്രവർത്തക ആനി ബസന്റ് റിപ്പോർട്ട് ചെയ്തു.

1921 ൽ ഇന്ത്യൻ സ്വാതന്ത്രസമരത്തിന്റെ ഭാഗമായി കേരളത്തിൽ നടന്ന കലാപങ്ങളിൽ ശ്രദ്ധേയമായ ഒന്നാണ് മലബാർ കലാപം.
 പത്തൊൻപതാം നൂറ്റാണ്ടിന്റെ തുടക്കത്തിലും മലബാറിലെ മാപ്പിളമാർ നിരവധി കലാപങ്ങൾ നടത്തിയിരുന്നു. പത്തൊൻപതാം നൂറ്റാണ്ടിലെ
 കർഷകകലാപങ്ങളിൽ ഭുരിഭാഗവും മലബാറിലെ തെക്കൻ താലൂക്കുകളായ ഏറനാട്ടിലും വള്ളുവനാട്ടിലും നടന്നു. ഈ താലൂക്കുകളിലെ 
ജീവിതസാഹചര്യങ്ങളിൽ ഒട്ടും മെച്ചമായിരുന്നില്ല. ഭൂമി പാട്ടത്തിനെടുത്ത് കൃഷി ചെയ്‌തും കൂലിവേല ചെയ്‌തും മാപ്പിളമാർ ഇവിടെ ഉപജീവനം നടത്തി.
 എന്നാൽ അടിക്കടി നേരിടേണ്ടി വന്ന കുടിയൊഴിപ്പിക്കൽ,അന്യായമായ നികുതി പിരിവ്,ഉയർന്ന പാട്ടം തുടങ്ങിയവ ഇവരുടെ ബുദ്ധിമുട്ടുകൾ വർധിപ്പിച്ചു. 
1841 ൽ വള്ളുവനാട്ടെ പള്ളിപ്പുറത്തും മണ്ണൂരിലുമുണ്ടായ കലാപങ്ങൾക്ക് കാരണമായത് കർഷകരും ജന്മിമാരും തമ്മിലുള്ള തർക്കമായിരുന്നു.
1849 ൽ മഞ്ചേരിയിലും 1851 ൽ കുളത്തൂരിലും 1852 ൽ മട്ടന്നൂരിലും അസംതൃപ്തരായ മാപ്പിളമാർ ഭൂഉടമകൾക്കും ബ്രിട്ടീഷുകാർക്കുമെതിരെ കലാപങ്ങൾ നടത്തി.

ഖിലാഫത്ത് പ്രസ്ഥാനത്തോടനുബന്ധിച്ചുണ്ടായ ലഹളയുടെ ആരംഭത്തിനു കാരണമായത് തുർക്കിയിലെ അഭ്യന്തരപ്രശ്നങ്ങളായിരുന്നു. തുർക്കി ഭരിക്കുന്ന
 ഖലീഫയെ ബ്രിട്ടീഷുകാർ നിഷ്കാസനം ചെയ്തതിലും അദ്ദേഹത്തിന്റെ നേതൃത്വത്തെ ചോദ്യം ചെയ്തതിലും പ്രതിഷേധിച്ച് മുസ്ലീങ്ങൾ രൂപം നൽകിയ 
പ്രസ്ഥാനമായിരുന്നു ഖിലാഫത്ത് പ്രസ്ഥാനം.

1792-ലാണ് മലബാർ ബ്രിട്ടീഷുകാരുടെ അധീനതയിലായത്. അപ്പോഴേക്കും മിക്ക രാജാക്കന്മാരും അവരുടെ ആധിപത്യം അംഗീകരിച്ചു കഴിഞ്ഞിരുന്നു.
 ബ്രിട്ടിഷ് ഭരണം കേരളത്തിൻറെ സാമ്പത്തികവ്യവസ്ഥയെ ആകെ മാറ്റിമറിച്ചു. ബ്രിട്ടീഷുകാർക്കു മുന്നേ തന്നെ പോർചുഗീസുകാർ കേരളത്തിന്റെ
 സാമൂഹിക വ്യവസ്ഥയെ മുച്ചൂടും നശിപ്പിച്ചിരുന്നു. ബ്രിട്ടീഷ് വ്യവസായങ്ങളുടെ ചരക്കുകൾ കേരളത്തിൽ പ്രചരിച്ചു. ബ്രിട്ടീഷുകാർ വരുന്നതുവരെ
 കേരളത്തിൽ പറയത്തക്ക ഭൂനികുതി ഉണ്ടായിരുന്നില്ല. കച്ചവട ചരക്കുകളുടെ ചുങ്കങ്ങളിൽ നിന്ന് ലഭിച്ചിരുന്ന ആദായമായിരുന്നു മുഖ്യ വരവിനം. 
നാട്ടുരാജാക്കന്മാർ തമ്മിലുള്ള കിടമത്സരം മൈസൂർ സുൽത്താന്മാർ മുതലെടുത്തു. അവർ കേരളത്തെ കീഴടക്കി. കൊച്ചിവരെ എത്തിയ ഹൈദരാലി 
മലബാറിൽ തന്റെ സാന്നിദ്ധ്യം ശക്തമാക്കി. മൈസൂർ സുൽത്താനായിരുന്ന ഹൈദരലിയുടെ ആക്രമണത്തിനു ശേഷമാണ് സ്ഥിരമായ ഭൂനികുതി 
ഏർപ്പെടുത്തിത്തുടങ്ങിയത്. ഹൈദരാലിയുടെ മരണശേഷം മകൻ ടിപ്പുസുൽത്താൻ അധികാരമേറ്റെടുത്തെങ്കിലും ആംഗ്ലോ-മൈസൂർ യുദ്ധങ്ങളിലൂടെ
 ബ്രിട്ടീഷുകാർ അധികാരം തിരികെപിടിച്ചു. ഹൈദരാലി ഏർപ്പെടുത്തിയ നികുതി ബ്രിട്ടീഷുകാർ ദുസ്സഹമാം വിധം വർദ്ധിപ്പിച്ചു. ഈ നികുതി വർദ്ധനവ് 
നിരവധി കുടുംബങ്ങളെ ഭൂരഹിതരും വഴിയാധാരം മാത്രമുള്ളവരുമാക്കി. യഥാർത്ഥ കൃഷിക്കാർക്ക് ഭൂമിയിൽ അവകാശമില്ലാതാകുകയും ഭൂമിയെല്ലാം
 ജന്മിമാരുടെയും ദേവസ്വത്തിന്റെയും സ്വകാര്യസ്വത്താവുകയും ചെയ്തു.മുസ്ലിം മതപ്രബോധകരും ആത്മീയ വാദികളുമായ ഹസ്സൻ ജിഫ്രി 
മമ്പുറം സയ്യിദ് അലവി എന്നിവരാൽ കുടിയാൻ മാരായിരുന്ന ഒട്ടേറെ അയിത്ത ജാതിക്കാർ ഇസ്‌ലാമിലേക്ക് മാർഗ്ഗം കൂടി. മാർക്കം കൂടിയതോടെ
 ചൂഷിതരായ കുടിയാന്മാരുടെ അസംതൃപ്തി ക്രമത്തിൽ ലഹളകളുടെ രൂപം കൈക്കൊണ്ടു. ചിലപ്പോൾ ജന്മിമാരെ ആക്രമിച്ചു തങ്ങളിൽ നിന്നും
 ചൂഷണം ചെയ്തിരുന്ന ധാന്യങ്ങളടക്കം ബലമായി തിരിച്ചെടുക്കുന്ന രൂപത്തിൽ മറ്റു ചിലപ്പോൾ ജന്മികളുടേയും ഉദ്യോഗസ്ഥന്മാരുടേയും എതിരായ
 കലാപങ്ങളുടെ രൂപത്തിൽ. മലബാറിൽ നല്ലൊരു പങ്കു കൃഷിക്കാരും മാപ്പിളമാരായിരുന്നു ജന്മികളൂം കാണക്കുടിയാന്മാരുമാകട്ടെ നമ്പൂതിരി,
 നായർ എന്നീ സമുദായക്കാരും. മലബാർ കലാപത്തിൽ മുഖ്യമായി പങ്കെടുത്തത് മുസ്ലിം സമുദായക്കാരായിരുന്നു. മാത്രവുമല്ല കലാപകാരികൾ 
ബ്രിട്ടീഷ് സൈന്യത്തെ ആക്രമിച്ചപ്പോൾ തന്നെ ബ്രിട്ടീഷുകാർക്ക് വേണ്ട ഒത്താശകൾ നൽകിയിരുന്ന കുറേയേറെ ജന്മികളേയും, 
കൊള്ളയടിക്കുകയും വധിക്കുകയും ചെയ്തു. ഹൈന്ദവസമുദായത്തിലുള്ള സാധാരണക്കാരും ഈ പീഡനത്തിന് ഇരയായി. അതുകൊണ്ട് തന്നെ
 ഈ കലാപങ്ങൾ പിന്നീട് മാപ്പിളലഹള എന്നാണറിയപ്പെട്ടത്. ഏറനാട് വള്ളുവനാട് താലൂക്കുകളിലെ ദരിദ്ര കർഷകർക്കും തൊഴിലാളികൾ‌ക്കുമിടയിൽ
 ദേശീയ പ്രസ്ഥാനത്തിനും തുടർന്ന് ഖിലാഫത്ത് പ്രസ്ഥാനത്തിനും ഉണ്ടായ സ്വധീനമാണ് മലബാർ കലാപത്തിനു വിത്തു പാകിയത്. സർക്കാരിന്റെ 
ജനദ്രോഹനയങ്ങൾകാരണം ഏറനാട്ടിലേയും വള്ളുവനാട്ടിലേയും മുസ്ലിം കർഷകരുടെ അസംതൃപ്തി ചെറുതല്ലാത്ത രീതിയിൽ വളർന്നിരുന്നു.
 തടി,ഉപ്പ്, പുകയില തുടങ്ങിയവയുടെ കുത്തകവ്യാപാരം കമ്പനി ഏറ്റെടുത്തു. അമ്പതോളം വരുന്ന അത്യാവശ്യ ഉൽപ്പന്നങ്ങൾക്ക് വൻതോതിൽ നികുതി ചുമത്തി.
 നികുതി ഭാരം സാധാരണജനങ്ങൾക്ക് താങ്ങാൻ പറ്റാത്തതാണെന്ന് കാണിച്ച് മലബാർ കളക്ടർ ബാബർ കമ്പനിക്കു കത്തയക്കുകപോലുമുണ്ടായി.
എന്നാൽ കമ്പനി അതൊന്നും ചെവിക്കൊള്ളാൻ കൂട്ടാക്കിയതുപോലുമില്ല. ''';

String Varyam_Kunn_kunju_ahammad_haji =''' മലബാർ സമരത്തിന് നേതൃത്വം നൽകിയവരിൽ പ്രമുഖനായ ഖിലാഫത്ത് നേതാവായിരുന്നു വാരിയൻ കുന്നത്ത് കുഞ്ഞഹമ്മദ് ഹാജി.
 ഏറനാട് കലാപത്തിൽ ഖിലാഫത്ത് പ്രസ്ഥാനത്തിൻറെ] ആലി മുസ്ലിയാരുടെ സന്തത സഹചാരിയും ശിഷ്യനുമായിരുന്നു അദ്ദേഹം.
 75,000ത്തോളം വരുന്ന ഒരു വലിയ സേനയെ കൂടെ നിർത്തിയാണ് തന്റെ സമാന്തരഭരണകൂടം സ്ഥാപിച്ചത്.

മലപ്പുറം ജില്ലയിലെ ഏറനാട് താലൂക്കിൽ പാണ്ടിക്കാട് പഞ്ചായത്തിലെ വെള്ളുവങ്ങാട് ആണ് ചക്കിപറമ്പൻ കുടുംബത്തിൽ 1883ൽ
 കുഞ്ഞഹമ്മദ്‌ ഹാജിയുടെ ജനനം. ചക്കിപറമ്പൻ മൊയ്തീൻ കുട്ടി ഹാജി പിതാവും, കരുവാരക്കുണ്ടിലെ പാറവട്ടി കുഞ്ഞായിശുമ്മ മാതാവുമാണ്. 
കുഞ്ഞഹമ്മദ് ഹാജിയുടെ മാതാപിതാക്കളുടെ കുടുംബങ്ങൾ പാരമ്പര്യമായി ബ്രിട്ടീഷ് വിരുദ്ധ നിലപാട് വെച്ച് പുലർത്തുന്നവരായിരുന്നു. 
സാമൂതിരിയുടെ കോഴിക്കോട് രാജ്യം നിലവിൽ ഉണ്ടായിരുന്നപ്പോൾ കച്ചവട കുടുംബമായിരുന്നു ചക്കിപറമ്പത്തുകാർ. സമ്പത്തും സ്ഥാനമാനങ്ങളുമുണ്ടായിരുന്ന
 ഈ തറവാട്ടുകാർ  കോഴിക്കോട് രാജ്യം ബ്രിട്ടീഷുകാർ പിടിച്ചെടുത്തതിന് ശേഷം നിസ്സഹകരണ സമീപനമായിരുന്നു പുലർത്തിയിരുന്നത്. 
തുടർന്ന് പലപ്പോഴായി ബ്രിട്ടീഷ് വിരുദ്ധ ലഹളകൾക്ക് ഈ കുടുംബാംഗങ്ങൾ തിരി കൊളുത്തിയിരുന്നു. പ്രതികാരമായി ചക്കി പറമ്പത്തുകാരുടെ
 സ്വത്തുവകകൾ ബ്രിട്ടീഷുകാർ പലപ്പോഴായി കയ്യടക്കി. ബ്രിട്ടീഷ് വേട്ടയാടലുകളെ തുടർന്ന് ചക്കി പറമ്പത്ത് നിന്നും വാരിയൻ കുന്ന് തൊടിയിലേക്ക്
 താമസം മാറേണ്ടി വന്നതിനെ തുടർന്ന് വാരിയൻ കുന്നൻ എന്നായിരുന്നു പിൽകാലത്ത് ഹാജി അറിയപ്പെട്ടിരുന്നത്.

ബാലകൃഷ്‌ണൻ എഴുത്തച്ഛൻ, വെള്ളുവങ്ങാട് മാപ്പിള പ്രൈമറി സ്കൂൾ എന്നിടങ്ങളിൽ നിന്ന് വിദ്യാഭ്യാസം നേടി. കുഞ്ഞികമ്മു മൊല്ലയുടെ ഓത്തുപള്ളി, 
ആലി മുസ്ലിയാരുടെ സഹോദരൻ മമ്മദ് കുട്ടി മുസ്ലിയാരുടെ ദർസ് എന്നിവിടങ്ങളിൽ നിന്ന് മത വിദ്യാഭ്യാസവും നേടി. മരവ്യാപാരിയായിരുന്ന പിതാവിനെ
 ചെറുപ്പകാലം തൊട്ടേ കുഞ്ഞഹമ്മദ്‌ ഹാജി സഹായിച്ചിരുന്നു. പോർച്ചുഗീസുകാരോട് യുദ്ധം ചെയ്ത് കൊല്ലപ്പെട്ട കുഞ്ഞി മരക്കാർ ആയിരുന്നു ഹാജിയുടെ
 വീര പുരുഷൻ. ബ്രീട്ടീഷ് ഗവർമെൻറ് നിരോധിച്ച യുദ്ധ കീർത്തനങ്ങളും, മറ്റു ശുഹദാ മൊലീദ് പാരായണവും സംഘടിപ്പിക്കുന്നതിലടക്കം സജീവമായിരുന്ന
 ഹാജി ഇക്കാരണങ്ങളാൽ പോലീസ് മേധാവിയായ ചേക്കുട്ടിയുടെ നോട്ടപ്പുള്ളിയായി മാറിയതോടെ മൂന്നോളം തവണ അദ്ദേഹത്തിന് നാട് വിടേണ്ടതായി വന്നു.
 മക്കയിലും,ബോംബെയിലും ഉള്ള പ്രവാസി ജീവിതത്തിനിടെ അറബി, ഉർദു,ഇംഗ്ലീഷ്, പേർഷ്യൻ ഭാഷകൾ പരിചയിച്ചു.

ബ്രിട്ടീഷ് സർക്കാരിനെതിരെ അരങ്ങേറിയ 1894 മണ്ണാർക്കാട്‌ ലഹളയെ തുടർന്ന് ഹാജിയുടെ കുടുംബാംഗങ്ങളിൽ പലരും കൊല്ലപ്പെടുകയോ നാടുകടത്തപ്പെടുകയോ
 ചെയ്തു. അന്തമാനിലേക്ക്‌ നാടുകടത്തപ്പെട്ടവരിൽ കുഞ്ഞഹമ്മദ് ഹാജിയുടെ പിതാവും ഉൾപ്പെട്ടിരുന്നു. പിഴയായി ഭീമമായ തുക ഹാജിയുടെ കുടുംബത്തിൽ നിന്നും
 ഈടാക്കിയ ബ്രിട്ടീഷ് അധികാരികൾ കുടുംബ സ്വത്തുക്കളും കണ്ടുകെട്ടി. ഇത് ഹാജിയിലെ ബ്രിട്ടീഷ് വിരുദ്ധ വികാരം വർദ്ധിപ്പിക്കാൻ കാരണമായി. ബ്രിട്ടീഷ് 
വിരുദ്ധ പ്രവർത്തനങ്ങൾ കാരണം രണ്ടാമതും നാടുവിടേണ്ടി വന്ന ഹാജി മടങ്ങി വന്നെങ്കിലും ജന്മനാട്ടിൽ പ്രവേശിക്കാൻ ബ്രിട്ടീഷ് സർക്കാർ അനുമതി നൽകാതെ
 വീണ്ടും മക്കയിലേക്ക് തിരിച്ചയച്ചു. 1915 ലാണ് പിന്നീട് ഹാജി മടങ്ങി വരുന്നത്. തിരിച്ചു വന്ന കുഞ്ഞഹമ്മദ് ഹാജിയെ മലബാറിൽ പ്രവേശിക്കാൻ സർക്കാർ 
അനുവദിച്ചില്ല. പിന്നീട് ജന്മ ഗ്രാമമായ നെല്ലിക്കുത്തിൽ കയറരുത് എന്ന നിബന്ധനയിൽ വിലക്ക് നീക്കി. തിരികെ വന്ന് കച്ചവടം പുനഃരാരംഭിച്ച ഹാജി 
സ്വപ്രയത്നത്താൽ സമ്പന്നനായി മാറി. പിതാവിന്റെ വസ്തു വകകൾ തിരിച്ചു പിടിക്കാനും ബ്രിട്ടീഷുകാരെ കെട്ട് കെട്ടിക്കാനുമുള്ള പ്രതികാരവാഞ്ജ
 ഉള്ളിൽ അടക്കി പിടിച്ചായിരുന്നു അദ്ദേഹത്തിൻറെ ജീവിതം. നാളുകൾക്കു ശേഷം ജന്മ ഗ്രാമത്തിൽ പ്രവേശിക്കാനുള്ള അനുമതി സർക്കാരിൽ നിന്നും 
ലഭിച്ചെങ്കിലും 1916-ൽ മലബാർ ജില്ല കളക്ടർ ഇന്നിസിനെ കരുവാരകുണ്ടിൽ വെച്ച് കൊല്ലാൻ ശ്രമിച്ച കേസിൽ വീണ്ടും അറസ്ററ് ചെയ്യപ്പെട്ടു. തെളിവുകൾ 
ലഭ്യമാകാതിരുന്നതിനെ തുടർന്ന് പിന്നീട് വിട്ടയക്കപ്പെട്ടു.

കച്ചവടം പച്ച പിടിച്ചതോടെ പൊതുരംഗത്ത് സജീവമായ ഇടപെടലുകൾക്ക് ഹാജി തുനിഞ്ഞിറങ്ങി. കച്ചവടത്തിൽ ലഭിക്കുന്ന സമ്പത്ത് ദരിദ്രർക്കും കുടിയാന്മാർക്കും
 കീഴാളർക്കും വീതം വെക്കുന്നതിനു ഹാജിക്ക് മടിയുണ്ടായിരുന്നില്ല. മൗലോദ്, റാതീബ്, പടപ്പാട്ട് എന്നിവകൾ സംഘടിപ്പിച്ചു അന്നദാനം നടത്തിയും, നേർച്ചകളിലെയും
 അതിൽ നടത്തുന്ന കോൽക്കളി ദഫ് കൈകൊട്ടി പാടലുകളുടെ സംഘാടകനായുമൊക്കെ കുഞ്ഞഹമ്മദ് ഹാജി പ്രശസ്തനായി. ലോകപരിചയം, ഭാഷാ പരിജ്ഞാനം,
 സ്വതസ്സിദ്ധമായ സംസാര ചാതുരി, കുടിയാൻ പ്രശ്നങ്ങളിലും, സാമൂഹിക -മതാചാര തലങ്ങളിലുമുള്ള സജീവ സാന്നിധ്യം എന്നിവയൊക്കെ കീഴാളർക്കിടയിലും,
 മാപ്പിളാർക്കിടയിലും ഹാജിക്ക് സ്വാധീനം വർദ്ധിപ്പിച്ചു. “സുൽത്താൻ കുഞ്ഞഹമ്മദ്” എന്നായിരുന്നു ഹാജി അറിയപ്പെട്ടിരുന്നത്. അന്നത്തെ ഡെപ്യൂട്ടി കലക്ടർ സി. 
ഗോപാലൻ നായർ ഹാജിയെ കുറിച്ച് പറഞ്ഞത്: ‘ഹിന്ദുക്കളുടെ രാജാവും മുഹമ്മദീയരുടെ അമീറും ഖിലാഫത്ത് സേനയുടെ കേണലുമായിട്ടായിരുന്നു 
വാരിയൻ കുന്നൻ ചമഞ്ഞിരുന്നത്’ എന്നാണ്. ജന്മി ബ്രിട്ടീഷ് വിരുദ്ധനായ ഹാജിക്ക് കിട്ടുന്ന സ്വീകാര്യത സർക്കാരിനെ ഭയപ്പെടുത്തിയിരുന്നു. 
അനുനയിപ്പിക്കാനായി ബ്രിട്ടീഷ് അധികാരികൾ നഷ്ട്ടപ്പെട്ടത്തിലധികം സമ്പത്തും, ഭൂസ്വത്തുക്കളും, അധികാര സ്ഥാനമാനങ്ങളും വാഗ്‌ദാനം ചെയ്‌തെങ്കിലും 
ഹാജി അത് സ്വീകരിച്ചില്ല.


ബോംബയിൽ ഉള്ള പ്രാവാസ ജീവിതത്തിനിടെ ഗാന്ധിജിയുടെ ആശയങ്ങളിൽ കുഞ്ഞഹമ്മദ് ഹാജിക്ക് പ്രതി പത്തി തോന്നിയിരുന്നു.
 1908ൽ മഞ്ചേരി രാമയ്യർ മുഖേന കോൺഗ്രെസ്സിലെത്തുന്നതും അങ്ങനെയാണ്.1920 ജൂലായ് 18 ന് കോഴിക്കോട് ജൂബിലി ഹാളിൽ നടന്ന മലബാർ ജില്ലയിലെ
 മുസ്ലിംകളുടെ ഒരു യോഗത്തിൽ മലബാർ ഖിലാഫത്ത് കമ്മിറ്റി രൂപീകരിക്കപ്പെട്ടതോടെ ഹാജിയുടെ പ്രവർത്തന മേഖല അതായി മാറി. 
1920 ആഗസ്റ്റ് മാസത്തിൽ ഗാന്ധിജിയും, ഷൗക്കത്തലിയും സംബന്ധിച്ച കോഴിക്കോട് കടപ്പുറത്തെ അമ്പതിനായിരത്തോളം പേർ പങ്കെടുത്ത യോഗത്തിൽ 
വാരിയം കുന്നത്ത് കുഞ്ഞഹമ്മദ് ഹാജി, ആലി മുസ്ലിയാർ, കൊന്നാര മുഹമ്മദ് കോയ തങ്ങൾ, കുമരംപുത്തൂർ സീതിക്കോയ തങ്ങൾ, ചെമ്പ്രശ്ശേരി കുഞ്ഞിക്കോയ തങ്ങൾ 
എന്നിവർ പ്രതേക ക്ഷണിതാക്കളായി സംബന്ധിച്ചു. ഖിലാഫത്ത് പ്രവർത്തനങ്ങൾ ഏറനാട്ടിലും വള്ളുവ നാട്ടിലും സജീവമായി നടക്കാൻ തുടങ്ങിയത് ഇതിനു
 ശേഷമാണ്. ബ്രിട്ടീഷ് അധികാരികളിൽ നിന്നും ജന്മികളിൽ നിന്നും കുടിയാന്മാർക്കെതിരായുള്ള ഒഴിപ്പിക്കലും, തൃശൂരിലെ ഖിലാഫത്ത് പ്രകടനം, മാധവ മേനോൻ
, യാക്കൂബ് ഹസ്സൻ എന്നിവരുടെ അറസ്ററ്, ഹാജിയുടെ പ്രസംഗങ്ങൾ നിരോധിച്ചു കലക്ടർ ഉത്തരവ് പോലുള്ള ചില പ്രകോപനങ്ങൾ ഒഴിച്ച് നിർത്തിയാൽ 
ആഗസ്ററ് 19 വരെ മലബാർ മേഖല ഏറെ കുറെ ശാന്തമായിരുന്നു.

ആഗസ്ററ് 19-ന് ബ്രിട്ടീഷ് സൈന്യം മമ്പുറം കിഴക്കേ പള്ളിയിൽ നടത്തിയ തിരച്ചിലാണ് മലബാർ കലാപത്തിൻറെ മൂല ഹേതു. ഇതിനു കാരണമായ 
സംഭവവികാസങ്ങൾ അരങ്ങേറുന്നതാവട്ടെ ആഗസ്ററ് മാസം തുടക്കത്തിലും. പൂക്കോട്ടൂർ കോവിലകത്തെ കാര്യസ്ഥനായ വടക്കേ വീട്ടിൽ മമ്മദ്നു
 ലഭിക്കേണ്ട കൂലിയെ പറ്റിയുള്ള തർക്കത്തെ തുടർന്ന് തിരുമൽപ്പാട് മമ്മദിനെ അറസ്റ്റു ചെയ്യിപ്പിക്കാൻ കരുക്കൾ നീക്കി. ഇൻസ്‌പെക്ടർ നാരായണ
 മേനോനെ വളഞ്ഞ മാപ്പിളമാർ അറസ്റ് ചെയ്യില്ലെന്ന് മമ്പുറം തങ്ങൾളുടെ പേരിൽ നാരായണ മേനോനെ കൊണ്ട് സത്യം ചെയ്യിക്കുകയും സ്വരാജിന് ജയ് 
വിളിപ്പിക്കുകയും ചെയ്തു. പൂക്കോട്ടൂർ തോക്ക് കേസ് നടന്ന അതേ വാരമാണ് വിലക്ക് ലംഘിച്ചു ആലിമുസ്ലിയാരും സംഘവും ചേരൂർ മഖ്ബറ തീർത്ഥാടനം
 നടത്തുന്നതും. ഈ രണ്ട് സംഭവങ്ങളും അരങ്ങേറിയത്തിൽ അരിശം പൂണ്ട മലബാർ കലക്ടർ തോമസ് മുൻകാലങ്ങളെ പോലെ മാപ്പിളമാർ ബ്രിട്ടീഷ് സർക്കാരിനെതിരെ
 യുദ്ധത്തിന് ഒരുങ്ങുന്നുണ്ടെന്നും ചേരൂർ മഖാം സന്ദർശനം അതിനു മുന്നോടിയാണെന്നും, മമ്പുറം പള്ളികളിൽ ആയുധ ശേഖരം ഉണ്ടെന്നും 
അത് പിടിച്ചെടുക്കണമെന്നും ഉത്തരവിട്ടതിനെ തുടർന്ന് ആഗസ്ത് 19ന് ബ്രിട്ടീഷ് പട്ടാളം മമ്പുറം കിഴക്കേ പള്ളി റൈഡ് ചെയ്തു. ആയുധങ്ങൾ ഒന്നും 
കണ്ടെടുക്കപ്പെട്ടില്ലെങ്കിലും കാര്യങ്ങൾ അതോടെ കൈവിട്ടു പോയി. വെള്ളപ്പട്ടാളം മമ്പുറം മഖാം പൊളിച്ചെന്നും കിഴക്കേ പള്ളി മലിനമാക്കിയെന്നുമുള്ള 
വ്യാജ വാർത്ത പരക്കെ പരന്നു. നിമിഷാർദ്ധത്തിൽ ആയിരക്കണക്കിനാളുകൾ മമ്പുറത്തേക്ക് ഒഴുകി. കാരണമന്വേഷിക്കുവാൻ ചെന്ന ജനക്കൂട്ടത്തിനു നേരെ
 പട്ടാളം വെടി വെച്ചതോടു കൂടി ജനക്കൂട്ടം അക്രാമകസക്തരായി പട്ടാളത്തെ എതിരിട്ടു. പട്ടാളം പിന്തിരിഞ്ഞോടി. ഇതോടെയാണ് ലഹള ആരംഭിക്കുന്നതും
 വാരിയൻകുന്നന്റെ കീഴിൽ വിപ്ലവ സർക്കാർ രൂപീകരിക്കപ്പെടുന്നതും. 20 മുതൽ 30 വരെ ആലിമുസ്ലിയാർ ആയിരുന്നു സമാന്തര സർക്കാർ ഭരണാധികാരി. 
 ആലി മുസ്ലിയാരിനു ശേഷം സമ്പൂർണ്ണർത്ഥത്തിൽ വാരിയൻ കുന്നൻ കുഞ്ഞഹമ്മദ് ഹാജി രാജാവായി മാറി.

തിരൂരങ്ങാടി റൈഡും,ആലി മുസ്‌ലിയാരെ അറസ്റ്റ് ചെയ്യാനുള്ള നീക്കവും അറിഞ്ഞ വാരിയൻ കുന്നൻ രക്ഷാ പദ്ധതികൾ മിനഞ്ഞു. പദ്ധതികളുടെ
 വിജയത്തിനായി നെബി മൗലൂദും അന്നദാനവും നേർച്ചയാക്കി.ആചാരങ്ങൾ പൂർത്തിയാക്കി തിരൂരങ്ങാടിയിൽ പോയി മുസ്ലിയാരെ മോചിപ്പിക്കണം
 എന്നതായിരുന്നു ലക്ഷ്യം. ഏകദേശം ആയിരത്തോളം ആളുകൾ സംബന്ധിച്ച മൗലൂദും പ്രാർത്ഥനയും, ഭക്ഷണം വിതരണവും കഴിഞ്ഞു തുറന്ന പോരാട്ടമെന്ന 
ഹസ്ര്വ പ്രസംഗം നടത്തി ആളുകളെയും കൂട്ടി ഹാജി പാണ്ടിക്കാട്ടേക്ക് മാർച് ചെയ്തു. പാണ്ടിക്കാട്ട് പോലീസ് സ്റ്റേഷനിലേക്ക് വരുന്ന ഹാജിയെയും കൂട്ടരെയും
 കണ്ട് സർക്കിൾ അഹമ്മദ് കുട്ടിയടക്കം പോലീസുകാർ മുഴുവനും ഓടി രക്ഷപ്പെട്ടു. സ്റ്റേഷൻ ആക്രമിച്ചു ആയുധങ്ങൾ കവർന്ന വാരിയൻ കുന്നന്റെ സൈന്യം .
 ബ്രിട്ടീഷ് ഓഫീസർ ഈറ്റൺ സായിപ്പിനെ തേടി പിടിച്ചു കൊന്നു കവലയിൽ നാട്ടി വെച്ചു.''';

 String AliMusliyar= '''ഇരുപതാം നൂറ്റാണ്ടിൻറെ തുടക്കത്തിൽ കേരളത്തിലെ മലബാർ കേന്ദ്രമാക്കി അരങ്ങേറിയ ബ്രിട്ടീഷ് വിരുദ്ധ കലാപത്തിന്റെ നേതൃനിരയിലുണ്ടായിരുന്ന
 പ്രമുഖ ഖാദിരിയ്യ സൂഫിയും, ഇസ്ലാമിക പണ്ഡിതനുമായിരുന്നു ആലി മുസ്‌ലിയാർ.

ബ്രിട്ടീഷ് രാജ് മദ്രാസ് പ്രവിശ്യയിലെ ഏറനാട് താലൂക്കിൽ (ഇപ്പോഴത്തെ മഞ്ചേരി നഗരസഭ) കിഴക്കേ അതിർത്തി ഗ്രാമമായ നെല്ലിക്കുത്ത് എരിക്കുന്നൻ 
പാലത്തും മൂലയിൽ ആലി മുസ്‌ലിയാർ 1864 ൽ ജനിച്ചു. മലബാറിലെ പ്രമുഖ സൂഫി വര്യനായിരുന്ന സയ്യിദ് അലവിയുടെ പിന്തുടർച്ചക്കാരിൽ പെട്ട 
എരിക്കുന്നൻപാലത്ത് മൂലയിൽ കുഞ്ഞിമൊയ്തീൻ, മഖ്ദൂം കുടുംബത്തിൻറെ പിന്തുടർച്ചക്കാരിൽ പെട്ട ഒറ്റകത്ത് ആമിന എന്നിവരാണ് മാതാപിതാക്കൾ. 
മാതാവിൻറെ കുടുംബ വഴി അറിയപ്പെടുന്ന ഇസ്ലാമിക പണ്ഡിതരാലും, ഖാസിമാരാലും പ്രസിദ്ധമായിരുന്നു. മാതാമഹൻ ഒറ്റകത്ത് മമ്മദു മുസ്ലിയാർ മുടിക്കോട്
 ഖാസി(ന്യായാധിപൻ) യായി പ്രശസ്തിയാർജ്ജിച്ചിരുന്നു.

മാതാപിതാക്കളിൽ നിന്നും അറിവ് കരസ്ഥമാക്കിയ ശേഷം നെല്ലികുത്ത് ഓത്തുപള്ളിയിലെ പ്രാഥമിക പഠനത്തിലൂടെ കിതാബുകൾ(മതഗ്രന്ഥങ്ങൾ), 
സർഫ്, നഹ്‌വ്(അറബി വ്യാകരണ ഗ്രന്ഥങ്ങൾ) എന്നിവയിൽ പ്രാവീണ്യം നേടി. പൊന്നാനി ദർസിൽ പത്തുവർഷകാലത്തെ ഉപരിപഠനത്തിലൂടെ തഫ്സീർ 
(ഖുർആൻ വ്യാഖ്യാനം), ഹദീസ്(പ്രവാചക ചര്യ), ഫിഖ്ഹ്, തസ്വവുഫ്‌, ഇൽമുൽ കലാം, ഇൽമുൽ മീക്കത്ത്, ഇൽമുൽ ഹഖാഇഖ്, ഇൽമുൽ നഹസ്, ഇൽമുൽ മആനി 
എന്നിവയിൽ അവഗാഹം നേടി. പൊന്നാനി വലിയ ജുമുഅത്ത് പള്ളി ദർസിൽ നിന്നും പൊന്നാനി വിളക്കത്തിരിക്കൽ കഴിഞ്ഞ് മുസ്ലിയാർ ആയ ശേഷം 
ദശാബ്ദക്കാലം നെല്ലിക്കുത്ത് പള്ളിയിലും, മമ്പുറം പള്ളിയിലും അധ്യാപനം, മമ്പുറം മഖാമിൻറെ പരിപാലനം എന്നിവ നിർവ്വഹിച്ചു. പിന്നീട് മക്കയിൽ ഹജ്ജ് 
തീർത്ഥാടനം നടത്തുകയും ഏഴ് വർഷക്കാലം മക്ക, മദീന മസ്ജിദുകളിൽ പഠനം നടത്തുകയും ചെയ്തു. കുഞ്ഞിക്കമ്മു മുല്ല, ഖാദിരിയ്യ സൂഫിയോഗി ശൈഖ്
 സൈനുദ്ദീൻ മുസ്ലിയാർ, സയ്യിദ് ഹുസൈൻ ഹബ്ശി, അല്ലാമാ സയ്യിദ് അഹ്മദ് സൈനി ദ്ദഹ്‌ലാൻ,ശൈഖ് മുഹമ്മദ് ഹിസ്ബുല്ലാഹി തുടങ്ങിയ വിശ്വ പ്രസിദ്ധ 
സൂഫികളും മഹാ പണ്ഡിതരുമായിരുന്നു ആലി മുസ്ലിയാരുടെ ഗുരുക്കന്മാർ. മക്കയിലെ പഠനത്തിന് ശേഷം കവരത്തിദ്വീപിൽ ഖാസി, മുദരിസ് എന്നീ 
ചുമതലകളിൽ വ്യാപൃതനായി.

പരമ്പരകളായി ബ്രിട്ടീഷ് വിരുദ്ധത കാത്തു സൂക്ഷിക്കുന്ന കുടുംബമായിരുന്നു ആലി മുസ്ലിയാരുടേത്. നെല്ലിക്കുത്ത്പയ്യനാട്ടു ഗുരുക്കൾ, മഞ്ചേരി ഹസ്സൻ 
(അത്തൻ)കുരിക്കൾ, ഇളംപുരളിശ്ശേരി ഉണ്ണിമൂപ്പൻ തുടങ്ങിയ ബ്രിട്ടീഷ് വിരുദ്ധ യോദ്ധാക്കൾ മുസ്ലിയാരുടെ ബന്ധു ജനങ്ങളായിരുന്നു. 1896-ലെ മഞ്ചേരി 
കാർഷിക കലാപത്തിൽ കൊല്ലപ്പെട്ടവരിൽ ഏറെ പേരും മുസ്ലിയാരുടെ ബന്ധുക്കളോ സുഹൃത്തുക്കളോ ആയിരുന്നു. ആലി മുസ്ലിയാരിൽ ജന്മനായുള്ള 
ബ്രിട്ടീഷ് വിരോധം ആളിക്കത്താൻ ഇത്തരം സംഭവങ്ങൾ പ്രേരിതമായിത്തീർന്നു.

ആലി മുസ്ലിയാർ കവരത്തി വിട്ടു ജന്മനാടായ ഏറനാട്ടിലേക്ക് തിരിച്ചു വരുന്നത് ബ്രിട്ടീഷ് വിരുദ്ധ സമരങ്ങളാൽ പ്രക്ഷുബ്ധമായിരുന്ന മലബാറിൽ 1894 ൽ
 ജ്യേഷ്‌ഠൻ ബ്രിട്ടീഷുകാരാൽ വധിക്കപ്പെട്ട വാർത്ത അറിഞ്ഞാണ്. സഹോദരൻ മമ്മിക്കുട്ടിയെ തൻറെ ചുമതല ഏൽപ്പിച്ചായിരുന്നു ഈ മടങ്ങി വരവ്. 
 മുസ്‌ലിയാർ നാട്ടിലേക്ക് തിരിച്ചെത്തുന്നതിനു മുൻപ് സഹോദരൻ എരിക്കുന്നിൽ അബ്ദുല്ല ഹാജിയെ ബ്രിട്ടീഷ് സർക്കാർ നാടുകടത്തി. പൊടിയാട്, മേൽമുറി, 
തൊടികപ്പലം, തിരൂരങ്ങാടി നടുവിൽ പള്ളി എന്നിവിടങ്ങളിലെ അധ്യാപകവൃത്തിക്ക് ശേഷം 1907 ഇൽ തിരൂരങ്ങാടി കിഴക്കേ പള്ളിയിൽ പ്രധാന 
അധ്യാപകനായി ആലി മുസ്ലിയാർ ചുമതലയേറ്റെടുത്തു. ഇവിടം കേന്ദ്രമാക്കിയാണ് കൊളോണിയൽ വിരുദ്ധ പോരാട്ടങ്ങളുടെ അമരത്തേക്ക് അദ്ദേഹം
 ഉയർന്നു വരുന്നത്. ഏറനാട്ടിലെ പല നേർച്ചകളുടെയും അമരക്കാരനായി മാറിയ മുസ്ലിയാർക്ക് നിരവധി മുരീദ് അനുചരന്മാരെ ഈ പ്രദേശങ്ങളിൽ 
വളർത്തിയെടുക്കാനായി. തിരൂരങ്ങാടിയിൽ വെച്ച് എം.പി. നാരായണ മേനോൻ, കട്ടിലശ്ശേരി മുസ്‌ലിയാർ എന്നിവരുമായുള്ള സൗഹൃദം കോൺഗ്രസിലേക്കും
 പിന്നീട് നിസ്സഹകരണ പ്രസ്ഥാനത്തിലേക്കും മുസ്ലിയാരെ കൊണ്ട് ചെന്നെത്തിച്ചു. ഗാന്ധിജിയും ഷൗക്കത്തലിയും പങ്കെടുത്ത കോഴിക്കോട് സമ്മേളനത്തിൽ
 ചെമ്പ്രശ്ശേരി തങ്ങൾ, വാരിയൻ കുന്നത്ത് എന്നിവരോടൊപ്പം പ്രതേക ക്ഷണിതാവായി സംബന്ധിക്കുകയും ഖിലാഫത്ത് സഭയുടെ ഏറനാട്ടിലെ ചുമതല
 ഏറ്റെടുക്കുകയും ചെയ്തു. ബ്രിട്ടീഷ്കാർക്കെതിരിലുള്ള സമാധാനപരമായ സമരപ്രവർത്തനങ്ങളിൽ വ്യാപൃതനായ അദ്ദേഹം പള്ളികളിൽ വെച്ച് നടത്തിയിരുന്ന
 പഠനക്ലാസുകൾ ബ്രിട്ടീഷ് വിരുദ്ധ ജനകീയ പ്രക്ഷോഭങ്ങൾക്ക് ജനങ്ങളെ സജ്ജരാക്കുന്നതായിരുന്നു.

സർക്കാർ വിരുദ്ധ സമരങ്ങളിൽ നിറസാന്നിധ്യമായി മാറിയ ആലി മുസ്ലിയാർക്ക് ആത്മീയ പുരോഹിതനായതിനാൽഎളുപ്പത്തിൽ ജനക്കൂട്ടത്തെ ആകർഷിക്കാൻ 
കഴിഞ്ഞിരുന്നു. കുഞ്ഞഹമ്മദ് ഹാജിയടക്കമുള്ള പല ഖിലാഫത്തുക്കാരും മുസ്ലിയാരുടെ ആത്മീയ ശിഷ്യന്മാരായിരുന്നു. ഭക്തിയാദരവോടെ തങ്ങളുപ്പാപ്പ 
എന്നായിരുന്നു അദ്ദേഹത്തെ അനുയായികൾ വിളിച്ചിരുന്നത്. ആലി മുസ്ലിയാർ കടന്നു വരുന്ന സമയത്തു തക്ബീറുകൾ (ദൈവ കീർത്തനം) മുഴക്കുമായിരുന്നു.
 ഇതൊക്കെ കൊണ്ട് തന്നെ ആത്മീയത മറയാക്കി മുസ്ലിയാർ ബ്രിട്ടീഷ് വിരുദ്ധത പ്രചരിപ്പിക്കുകയായിരുന്നുവെന്നു കളക്ടർ വിലയിരുത്തുകയും പ്രദേശത്തെ 
സൂഫി പുണ്യളൻമാരുടെയും, രക്തസാക്ഷികളുടെയും ശവ കുടീരങ്ങൾ കേന്ദ്രീകരിച്ചു നടക്കുന്ന നേർച്ച-പ്രാർത്ഥനകൾ, തീർത്ഥയാത്രകൾ, റാതെബുകൾ 
എന്നിവയ്ക്ക് വിലക്ക് ഏർപ്പെടുത്തുകയും ചെയ്തു. വിലക്ക് ലംഘിച്ചു ചേരൂർ നേർച്ച അരങ്ങേറി. വൻ ജനാവലിയോടെ ശവകുടീരത്തിൽ പ്രാർത്ഥനകളും
 പ്രകീർത്തനങ്ങളും സംഘടിപ്പിച്ച മുസ്‌ലിയാർ എല്ലാ വെള്ളിഴാഴ്ചകളിലും ഇത് പതിവാക്കി. ഇതോടെ വിലക്ക് ധിക്കരിച്ചു പ്രാർത്ഥന സംഘടിപ്പിക്കുന്നവരെ
 കഠിന മുഷ്ടി ഉപയോഗിച്ച് നേരിടുമെന്ന് കളക്ടർ തോമസ് മുസ്ലിയാർക്ക് നോട്ടീസ് നൽകി. മുന്നറിയിപ്പ് തൃണവത്കരിച്ചു തടയാൻ ഒരുങ്ങിയ പോലീസുകാരനെ
 തള്ളി വീഴ്ത്തി ആലി മുസ്ലിയാരും അനുയായികളും ചേരൂർ മഖാമിലേക്ക് സിയാറത്തു യാത്ര നടത്തി. മലബാർ കലാപത്തിലെ ആദ്യ അക്രമണമായാണ് 
ചരിത്രകാരന്മാർ ഇതിനെ വിശേഷിപ്പിക്കുന്നത്.''';